Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_cloudwatch_log_group.image_processor_logs: Refreshing state... [id=/aws/lambda/emenu-image-processor-dev]
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_iam_role.presigned_url_role: Refreshing state... [id=presigned-url-role-dev]
aws_s3_object.presigned_url_generator_zip: Refreshing state... [id=lambdas/presigned_url_generator/presigned_url_generator.zip]
aws_s3_object.image_processor_zip: Refreshing state... [id=lambdas/image_processor/image_processor.zip]
aws_cloudwatch_log_group.presigned_url_generator_logs: Refreshing state... [id=/aws/lambda/emenu-presigned-url-generator-dev]
aws_iam_role.image_processor_role: Refreshing state... [id=image-processor-role-dev]
aws_s3_bucket.restaurant_assets: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250929095628385500000001]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250929095628385500000002]
data.aws_s3_bucket.lambda_code: Read complete after 1s [id=emenu-lambda-code-bucket]
data.aws_s3_object.lambda_layer: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.lambda_layer: Read complete after 1s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:23]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ]
aws_s3_bucket_public_access_block.restaurant_assets_pab: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.image_processor_policy: Refreshing state... [id=image-processor-role-dev:image-processor-policy-dev]
aws_s3_bucket_server_side_encryption_configuration.restaurant_assets_encryption: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.presigned_url_policy: Refreshing state... [id=presigned-url-role-dev:presigned-url-policy-dev]
aws_s3_bucket_versioning.restaurant_assets_versioning: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_cors_configuration.restaurant_assets_cors: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_lambda_function.image_processor: Refreshing state... [id=emenu-image-processor-dev]
aws_lambda_function.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_policy.restaurant_assets_policy: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/boss]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/waiter]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=4l90vqi7nfam318ci1tml91j3n]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=19kbapekjfmn2jkue74baferh5]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/demo]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_function_url.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-emenu_datasource]
aws_s3_bucket_notification.image_upload_notification: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_appsync_resolver.update_restaurant_subscription_plan_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantSubscriptionPlan]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createRestaurant]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUser]
aws_appsync_resolver.update_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishType]
aws_appsync_resolver.list_orders_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listOrders]
aws_appsync_resolver.update_restaurant_info_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantInfo]
aws_appsync_resolver.place_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-placeOrder]
aws_appsync_resolver.update_order_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateOrderStatus]
aws_appsync_resolver.create_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDishType]
aws_appsync_resolver.update_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDish]
aws_appsync_resolver.delete_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDish]
aws_appsync_resolver.create_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDish]
aws_appsync_resolver.invite_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-inviteWaiter]
aws_appsync_resolver.update_dish_availability_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishAvailability]
aws_appsync_resolver.checkout_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-checkoutOrder]
aws_appsync_resolver.list_dish_types_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishTypes]
aws_appsync_resolver.get_restaurant_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getRestaurant]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishes]
aws_appsync_resolver.delete_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDishType]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.emenu_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "emenu_post_confirmation" {
        id                             = "emenu_post_confirmation"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:23",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_server will be updated in-place
  ~ resource "aws_lambda_function" "emenu_server" {
        id                             = "emenu-server"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:23",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.common_mongoose_models must be replaced
-/+ resource "aws_lambda_layer_version" "common_mongoose_models" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:23" -> (known after apply)
      ~ code_sha256                 = "CBQCKPtQeTgRlw2F6B5qDyYYXgZEq6CyZMf2d0P96bk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-10-09T07:51:41.875+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "5b7cc2a182f0573e76c31337b281ee7a" -> "88ead56a0524415e39cc46bb7ce91ccf" # forces replacement
      ~ source_code_size            = 2695105 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_object.image_processor_zip will be destroyed
  # (because aws_s3_object.image_processor_zip is not in configuration)
  - resource "aws_s3_object" "image_processor_zip" {
      - arn                           = "arn:aws:s3:::emenu-lambda-code-bucket/lambdas/image_processor/image_processor.zip" -> null
      - bucket                        = "emenu-lambda-code-bucket" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/zip" -> null
      - etag                          = "7eee628f98cd179f3dec3b0931501e1f-3" -> null
      - force_destroy                 = false -> null
      - id                            = "lambdas/image_processor/image_processor.zip" -> null
      - key                           = "lambdas/image_processor/image_processor.zip" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../lambdas/image_processor/image_processor.zip" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "MZ6FBqtRIkxmO9geKRfdvGOASY80y_yh" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_s3_object.presigned_url_generator_zip will be destroyed
  # (because aws_s3_object.presigned_url_generator_zip is not in configuration)
  - resource "aws_s3_object" "presigned_url_generator_zip" {
      - arn                           = "arn:aws:s3:::emenu-lambda-code-bucket/lambdas/presigned_url_generator/presigned_url_generator.zip" -> null
      - bucket                        = "emenu-lambda-code-bucket" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/zip" -> null
      - etag                          = "c85d3d3d3289864ba835fccba2e2f3b5" -> null
      - force_destroy                 = false -> null
      - id                            = "lambdas/presigned_url_generator/presigned_url_generator.zip" -> null
      - key                           = "lambdas/presigned_url_generator/presigned_url_generator.zip" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../lambdas/presigned_url_generator/presigned_url_generator.zip" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "E.ccre4ZG7XGrYzEvYm7euYV4OcncKYB" -> null
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
